In [3]:
import pandas as pd


def query_database(SQL):
    
    eider = False
    dbname = 'wwtga001'
    port = 8192
    host = 'ww-tga-001.csupvvauvubf.us-east-1.redshift.amazonaws.com'

    user = 'XXX'
    pw = 'XXX'
    
    
    if eider:
        from pg import DB
        rs = DB(dbname=dbname, host=host, port=port, user=user, passwd=pw)
        df = rs.query(SQL).getresult()

    else:
        import psycopg2
        conn = psycopg2.connect(dbname=dbname, port=port, user=user, password=pw, host=host)
        cur = conn.cursor()
        cur.execute(SQL)
        df = cur.fetchall()

    return df


SQL = """
    SELECT TOP 3 *
    FROM DUCOI_DIM
"""

pd.DataFrame(query_database(SQL))

,0,1,2,3,4,5,6,7,8,9,...,64,65,66,67,68,69,70,71,72,73
0,1,103-9324660-1340624,0800629167,7,USD,510698980,None,494223770,2496838653,103-5762256-4426262,...,Penobscot,Bangor,503845880,04401,BANGOR,ME,US,UNITED STATES,Amzn,04401
1,3,249-7833136-4598758,4091913938,5,JPY,435580785,None,468815134,291582045,249-9757659-7291551,...,Midoricho,NOT_MAPPED,435580785,180-0012,None,None,JP,JAPAN,Amzn,180-0012
2,3,249-8366891-8233949,4049007878,7,JPY,456669395,2511-1137821-040003,467716495,573557485,249-7035331-7427539,...,Kamihiratsuka,NOT_MAPPED,456669395,254-0055,None,None,JP,JAPAN,Amzn,254-0055